Repository: nahidsaikat/insan
Catalog: lib/l10n/app_*.arb
Languages: bn

# appTitle
source: AgroStock Manager
bn: এগ্রোস্টক ম্যানেজার

# dashboardTitle
source: Dashboard
bn: ড্যাশবোর্ড

# inventoryTitle
source: Inventory
bn: ইনভেন্টরি

# transactionsTitle
source: Transactions
bn: লেনদেন

# expensesInvestmentsTitle
source: Expenses & Investments
bn: খরচ ও বিনিয়োগ

# seasonManagementTitle
source: Season Management
bn: সিজন ব্যবস্থাপনা

# partyManagementTitle
source: Party Management
bn: পার্টি ব্যবস্থাপনা

# inventoryLocationsTitle
source: Inventory Locations
bn: ইনভেন্টরি স্থান

# noLocationsFoundMessage
source: No inventory locations found. Add your first location!
bn: কোনো ইনভেন্টরি স্থান পাওয়া যায়নি। আপনার প্রথম স্থান যোগ করুন!

# confirmDeleteLocation
source: Are you sure you want to delete this inventory location?
bn: আপনি কি নিশ্চিত যে আপনি এই ইনভেন্টরি স্থানটি মুছে ফেলতে চান?

# settingsTitle
source: Settings
bn: সেটিংস

# aboutTitle
source: About
bn: সম্পর্কে

# activeSeasonLabel
source: Active Season:
bn: বর্তমান সিজন:

# noActiveSeasonMessage
source: No active season found. Please create or select one.
bn: কোনো সক্রিয় সিজন পাওয়া যায়নি। অনুগ্রহ করে একটি তৈরি করুন বা নির্বাচন করুন।

# createSeasonButton
source: Create New Season
bn: নতুন সিজন তৈরি করুন

# selectSeasonButton
source: Select Season
bn: সিজন নির্বাচন করুন

# addSeasonPrompt
source: Enter new season name:
bn: নতুন সিজনের নাম লিখুন:

# seasonNameHint
source: e.g., Boro 2025
bn: উদাহরণ: বোরো ২০২৫

# saveButton
source: Save
bn: সংরক্ষণ করুন

# cancelButton
source: Cancel
bn: বাতিল করুন

# editButton
source: Edit
bn: সম্পাদনা করুন

# deleteButton
source: Delete
bn: মুছুন

# confirmDeleteSeason
source: Are you sure you want to delete this season and all associated data?
bn: আপনি কি নিশ্চিত যে আপনি এই সিজন এবং এর সাথে সম্পর্কিত সমস্ত ডেটা মুছে ফেলতে চান?

# seasonStartHint
source: Start Date
bn: শুরুর তারিখ

# seasonEndHint
source: End Date
bn: শেষের তারিখ

# seasonStatus
source: Status:
bn: অবস্থা:

# activeStatus
source: Active
bn: সক্রিয়

# inactiveStatus
source: Inactive
bn: নিষ্ক্রিয়

# partyFilterAll
source: All
bn: সব

# partyNameHint
source: Party Name
bn: পার্টির নাম

# partyTypeHint
source: Party Type
bn: পার্টির প্রকার

# partyContactHint
source: Phone Number
bn: ফোন নম্বর

# partyAddressHint
source: Address
bn: ঠিকানা

# addPartyButton
source: Add New Party
bn: নতুন পার্টি যোগ করুন

# partyTypeInvestor
source: Investor
bn: বিনিয়োগকারী

# partyTypeFarmer
source: Farmer
bn: কৃষক

# partyTypeCustomer
source: Customer
bn: ক্রেতা

# partyTypeOtherVendor
source: Other Vendor
bn: অন্যান্য বিক্রেতা

# noPartiesFoundMessage
source: No parties found. Add your first contact!
bn: কোন পার্টি খুঁজে পাওয়া যায়নি। আপনার প্রথম যোগাযোগ যোগ করুন!

# noFilteredPartiesFoundMessage
source: No parties found.
bn: কোন পার্টি খুঁজে পাওয়া যায়নি।

# productNameHint
source: Product Name
bn: পণ্যের নাম

# productUnitHint
source: Unit (e.g., Kg)
bn: একক (যেমন, কেজি)

# addProductButton
source: Add New Product
bn: নতুন পণ্য যোগ করুন

# locationNameHint
source: Location Name (e.g., Godown A)
bn: স্থানের নাম (যেমন, গুদাম ক)

# locationAddressHint
source: Address
bn: ঠিকানা

# locationRentCostHint
source: Monthly Rent Cost
bn: মাসিক ভাড়া খরচ

# addLocationButton
source: Add New Location
bn: নতুন স্থান যোগ করুন

source: Total Sacks Purchased:
bn: মোট বস্তা ক্রয়:

source: Total Sacks Sold:
bn: মোট বস্তা বিক্রয়:

source: Current In-Stock Value:
bn: বর্তমান মজুদের মূল্য:

source: Total Expenses:
bn: মোট খরচ:

source: Total Investments:
bn: মোট বিনিয়োগ:

# recordPurchaseButton
source: Record Purchase
bn: ক্রয় রেকর্ড করুন

# recordSaleButton
source: Record Sale
bn: বিক্রয় রেকর্ড করুন

# addExpenseButton
source: Add Expense
bn: খরচ যোগ করুন

# addInvestmentButton
source: Add Investment
bn: বিনিয়োগ যোগ করুন

source: View All Inventory
bn: সমস্ত ইনভেন্টরি দেখুন

source: View All Expenses
bn: সমস্ত খরচ দেখুন

source: View All Investments
bn: সমস্ত বিনিয়োগ দেখুন

source: No sacks found.
bn: কোনো বস্তা পাওয়া যায়নি।

source: No expenses found.
bn: কোনো খরচ পাওয়া যায়নি।

source: No investments found.
bn: কোনো বিনিয়োগ পাওয়া যায়নি।

source: Purchase Details
bn: ক্রয়ের বিবরণ

source: Sale Details
bn: বিক্রয়ের বিবরণ

# dateLabel
source: Date:
bn: তারিখ:

# productLabel
source: Product:
bn: পণ্য:

# vendorLabel
source: Vendor:
bn: বিক্রেতা:

# customerLabel
source: Customer:
bn: ক্রেতা:

# weightLabel
source: Weight (Kg):
bn: ওজন (কেজি):

# pricePerKgLabel
source: Price per Kg:
bn: কেজি প্রতি মূল্য:

# carryingCostLabel
source: Carrying Cost:
bn: বহন খরচ:

# locationLabel
source: Location:
bn: স্থান:

# statusLabel
source: Status:
bn: অবস্থা:

# uniqueSackIdentifierLabel
source: Sack ID:
bn: বস্তা আইডি:

source: Add New Sack
bn: নতুন বস্তা যোগ করুন

source: Update Sack
bn: বস্তা আপডেট করুন

# sackStatusInStock
source: In Stock
bn: মজুদ আছে

# sackStatusSold
source: Sold
bn: বিক্রি হয়েছে

# sackStatusDiscarded
source: Discarded
bn: বাদ দেওয়া হয়েছে

# expenseCategoryHint
source: Category
bn: বিভাগ

# expenseDescriptionHint
source: Description
bn: বিবরণ

# expenseAmountHint
source: Amount
bn: পরিমাণ

# expenseCategoryTransport
source: Transport
bn: পরিবহন

# expenseCategoryLabor
source: Labor
bn: শ্রমিক

# expenseCategoryRent
source: Rent
bn: ভাড়া

# expenseCategoryMaintenance
source: Maintenance
bn: রক্ষণাবেক্ষণ

# expenseCategoryOther
source: Other
bn: অন্যান্য

# investorLabel
source: Investor:
bn: বিনিয়োগকারী:

# investmentAmountHint
source: Amount
bn: পরিমাণ

# investmentNotesHint
source: Notes
bn: নোট

# profitDistributionLabel
source: Profit Distribution
bn: লাভ বিতরণ

# amountDistributedHint
source: Amount Distributed
bn: বিতরণকৃত পরিমাণ

# profitDistributionNotesHint
source: Notes
bn: নোট

# purchaseRequiredFieldsMessage
source: Please fill all required purchase fields.
bn: অনুগ্রহ করে ক্রয়ের জন্য প্রয়োজনীয় সকল ক্ষেত্র পূরণ করুন।

# saleRequiredFieldsMessage
source: Please select a sack and fill all required sale fields.
bn: অনুগ্রহ করে একটি বস্তা নির্বাচন করুন এবং বিক্রয়ের জন্য প্রয়োজনীয় সকল ক্ষেত্র পূরণ করুন।

# invalidNumberInputMessage
source: Please enter valid numbers for weight and price.
bn: ওজন এবং মূল্যের জন্য বৈধ সংখ্যা লিখুন।

# purchaseSuccessMessage
source: Purchase recorded successfully!
bn: ক্রয় সফলভাবে রেকর্ড করা হয়েছে!

# saleSuccessMessage
source: Sale recorded successfully!
bn: বিক্রয় সফলভাবে রেকর্ড করা হয়েছে!

source: Error recording purchase:
bn: ক্রয় রেকর্ড করতে ত্রুটি:

source: Error recording sale:
bn: বিক্রয় রেকর্ড করতে ত্রুটি:

# selectVendorPrompt
source: Please select a vendor.
bn: অনুগ্রহ করে একজন বিক্রেতা নির্বাচন করুন।

# selectLocationPrompt
source: Please select a location.
bn: অনুগ্রহ করে একটি স্থান নির্বাচন করুন।

# selectCustomerPrompt
source: Please select a customer.
bn: অনুগ্রহ করে একটি ক্রেতা নির্বাচন করুন।

# selectSackToSellPrompt
source: Please select a sack to sell.
bn: বিক্রয়ের জন্য একটি বস্তা নির্বাচন করুন।

source: Record Expense
bn: খরচ রেকর্ড করুন

source: Record Investment
bn: বিনিয়োগ রেকর্ড করুন

# amountLabel
source: Amount:
bn: পরিমাণ:

# descriptionLabel
source: Description:
bn: বিবরণ:

# categoryLabel
source: Category:
bn: শ্রেণী:

# investmentDescriptionHint
source: e.g., Initial capital, Loan
bn: যেমন: প্রাথমিক মূলধন, ঋণ

source: Recent Expenses
bn: সাম্প্রতিক খরচ

source: Recent Investments
bn: সাম্প্রতিক বিনিয়োগ

# confirmDeleteExpense
source: Are you sure you want to delete this expense?
bn: আপনি কি নিশ্চিত যে আপনি এই খরচটি মুছে ফেলতে চান?

# confirmDeleteInvestment
source: Are you sure you want to delete this investment?
bn: আপনি কি নিশ্চিত যে আপনি এই বিনিয়োগটি মুছে ফেলতে চান?

# expenseRequiredFieldsMessage
source: Please fill all required expense fields.
bn: অনুগ্রহ করে খরচের জন্য প্রয়োজনীয় সকল ক্ষেত্র পূরণ করুন।

# invalidExpenseAmount
source: Please enter a valid positive amount for expense.
bn: অনুগ্রহ করে খরচের জন্য একটি বৈধ ধনাত্মক পরিমাণ লিখুন।

# investmentRequiredFieldsMessage
source: Please select an investor and fill all required investment fields.
bn: অনুগ্রহ করে একজন বিনিয়োগকারী নির্বাচন করুন এবং বিনিয়োগের জন্য প্রয়োজনীয় সকল ক্ষেত্র পূরণ করুন।

# invalidInvestmentAmount
source: Please enter a valid positive amount for investment.
bn: অনুগ্রহ করে বিনিয়োগের জন্য একটি বৈধ ধনাত্মক পরিমাণ লিখুন।

# expenseSuccessMessage
source: Expense recorded successfully!
bn: খরচ সফলভাবে রেকর্ড করা হয়েছে!

# investmentSuccessMessage
source: Investment recorded successfully!
bn: বিনিয়োগ সফলভাবে রেকর্ড করা হয়েছে!

source: Error recording expense:
bn: খরচ রেকর্ড করতে ত্রুটি:

source: Error recording investment:
bn: বিনিয়োগ রেকর্ড করতে ত্রুটি:

# selectInvestorPrompt
source: Please select an investor.
bn: অনুগ্রহ করে একজন বিনিয়োগকারী নির্বাচন করুন।

# profitDistributionTitle
source: Profit Distribution
bn: লাভ বন্টন

source: Season Financial Summary
bn: সিজনের আর্থিক সারাংশ

source: Total Revenue:
bn: মোট আয়:

source: Total Purchase Cost:
bn: মোট ক্রয় খরচ:

source: Total Carrying Cost:
bn: মোট বহন খরচ:

source: Net Profit/Loss:
bn: নীট লাভ/ক্ষতি:

source: Record Profit Distribution
bn: লাভ বন্টন রেকর্ড করুন

# recipientLabel
source: Recipient:
bn: গ্রহীতা:

# distributionDescriptionHint
source: e.g., Share for Investor X, Owner's drawing
bn: যেমন: বিনিয়োগকারী X এর জন্য অংশ, মালিকের উত্তোলন

source: Record Distribution
bn: বন্টন রেকর্ড করুন

source: Recent Distributions
bn: সাম্প্রতিক বন্টন

# noDistributionsFound
source: No profit distributions found for this season.
bn: এই সিজনের জন্য কোনো লাভ বন্টন পাওয়া যায়নি।

# confirmDeleteDistribution
source: Are you sure you want to delete this profit distribution?
bn: আপনি কি নিশ্চিত যে আপনি এই লাভ বন্টনটি মুছে ফেলতে চান?

# distributionRequiredFieldsMessage
source: Please select a recipient and fill all required distribution fields.
bn: অনুগ্রহ করে একজন গ্রহীতা নির্বাচন করুন এবং বন্টনের জন্য প্রয়োজনীয় সকল ক্ষেত্র পূরণ করুন।

# invalidDistributionAmount
source: Please enter a valid positive amount for distribution.
bn: অনুগ্রহ করে বন্টনের জন্য একটি বৈধ ধনাত্মক পরিমাণ লিখুন।

# distributionSuccessMessage
source: Profit distribution recorded successfully!
bn: লাভ বন্টন সফলভাবে রেকর্ড করা হয়েছে!

source: Error recording distribution:
bn: বন্টন রেকর্ড করতে ত্রুটি:

# selectRecipientPrompt
source: Please select a recipient.
bn: অনুগ্রহ করে একজন প্রাপক নির্বাচন করুন।

# totalDistributedAmount
source: Total Distributed:
bn: মোট বন্টিত:

source: Undistributed Profit:
bn: অবন্টিত লাভ:

# distributionExceedsProfit
source: Distribution amount exceeds undistributed profit!
bn: বন্টনের পরিমাণ অবন্টিত লাভের চেয়ে বেশি!

# cannotDistributeNegativeProfit
source: Cannot distribute profit when net profit is zero or negative.
bn: নীট লাভ শূন্য বা ঋণাত্মক হলে লাভ বন্টন করা যাবে না।

# sackDetailsTitle
source: Sack Details
bn: বস্তার বিবরণ

source: General Info
bn: সাধারণ তথ্য

source: Current Location:
bn: বর্তমান অবস্থান:

source: Total Purchase Value:
bn: মোট ক্রয় মূল্য:

source: Total Sale Value:
bn: মোট বিক্রয় মূল্য:

source: Net Gain/Loss:
bn: নীট লাভ/ক্ষতি:

# notAvailable
source: N/A
bn: উপলভ্য নয়

source: Unknown
bn: অজানা

source: Sack not found!
bn: বস্তা পাওয়া যায়নি!

# sackUpdatedSuccessfully
source: Sack details updated successfully!
bn: বস্তার বিবরণ সফলভাবে আপডেট করা হয়েছে!

source: Error updating sack:
bn: বস্তা আপডেট করতে ত্রুটি:

source: Sack deleted successfully!
bn: বস্তা সফলভাবে মুছে ফেলা হয়েছে!

source: Error deleting sack:
bn: বস্তা মুছে ফেলতে ত্রুটি:

# confirmDeleteSack
source: Are you sure you want to delete this sack?
bn: আপনি কি নিশ্চিত যে আপনি এই বস্তাটি মুছে ফেলতে চান?

# confirmDeleteSoldSack
source: This sack has been sold. Deleting it will affect your financial records. Are you sure you want to delete it anyway?
bn: এই বস্তাটি বিক্রি হয়ে গেছে। এটি মুছে ফেললে আপনার আর্থিক রেকর্ডে প্রভাব পড়বে। আপনি কি তবুও এটি মুছে ফেলতে চান?

source: Delete Anyway
bn: যাইহোক মুছে ফেলুন

# singleSaleTab
source: Single Sack Sale
bn: একক বস্তা বিক্রয়

# bulkSaleTab
source: Bulk Sale
bn: একসাথে বিক্রয়

source: Selling Sack
bn: বিক্রয় হচ্ছে বস্তা

# selectSackForSale
source: Select a sack from Inventory to sell individually.
bn: এককভাবে বিক্রয় করার জন্য ইনভেন্টরি থেকে একটি বস্তা নির্বাচন করুন।

# selectSackFromInventoryTip
source: To sell a single sack, please go to the Inventory screen and tap on the specific sack to sell it.
bn: একক বস্তা বিক্রি করতে, ইনভেন্টরি স্ক্রিনে যান এবং নির্দিষ্ট বস্তাটিতে ট্যাপ করে বিক্রি করুন।

# saleDateLabel
source: Sale Date:
bn: বিক্রয়ের তারিখ:

# saleWeightLabel
source: Sale Weight:
bn: বিক্রয়ের ওজন:

# salePricePerKgLabel
source: Sale Price per Kg:
bn: প্রতি কেজি বিক্রয় মূল্য:

# saleCarryingCostLabel
source: Sale Carrying Cost:
bn: বিক্রয় বহন খরচ:

# customerRequired
source: Please select a customer.
bn: অনুগ্রহ করে একজন ক্রেতা নির্বাচন করুন।

source: Select Customer
bn: ক্রেতা নির্বাচন করুন

source: Record Sale
bn: বিক্রয় রেকর্ড করুন

# validAmountRequired
source: Please enter valid positive sale weight and price.
bn: অনুগ্রহ করে বৈধ ধনাত্মক বিক্রয় ওজন এবং মূল্য লিখুন।

# saleWeightExceedsPurchase
source: Sale weight cannot exceed purchase weight.
bn: বিক্রয়ের ওজন ক্রয় ওজনের বেশি হতে পারে না।

source: Sale recorded successfully!
bn: বিক্রয় সফলভাবে রেকর্ড করা হয়েছে!

# selectSacksAndFillFields
source: Please select sacks and fill all required fields for bulk sale.
bn: অনুগ্রহ করে একসাথে বিক্রয়ের জন্য বস্তা নির্বাচন করুন এবং প্রয়োজনীয় সকল ক্ষেত্র পূরণ করুন।

# validPriceRequired
source: Please enter a valid positive sale price per Kg.
bn: অনুগ্রহ করে প্রতি কেজি একটি বৈধ ধনাত্মক বিক্রয় মূল্য লিখুন।

# totalCarryingCostLabel
source: Total Bulk Carrying Cost:
bn: মোট বহন খরচ:

# totalCarryingCostHint
source: e.g., transport cost for the entire lot
bn: যেমন: পুরো লটের পরিবহন খরচ

source: Total Selected Weight:
bn: মোট নির্বাচিত ওজন:

source: Calculated Sale Amount:
bn: গণনাকৃত বিক্রয় পরিমাণ:

source: Record Bulk Sale
bn: একসাথে বিক্রয় রেকর্ড করুন

# noSacksInStock
source: No sacks currently in stock for this season.
bn: এই সিজনের জন্য বর্তমানে কোনো বস্তা ইন-স্টক নেই।

source: Bulk sale recorded successfully!
bn: একসাথে বিক্রয় সফলভাবে রেকর্ড করা হয়েছে!

source: Error recording bulk sale:
bn: একসাথে বিক্রয় রেকর্ড করতে ত্রুটি:

# purchaseDateLabel
source: Purchase Date:
bn: ক্রয় তারিখ:

# purchaseWeightLabel
source: Purchase Weight:
bn: ক্রয় ওজন:

# purchasePricePerKgLabel
source: Purchase Price per Kg:
bn: প্রতি কেজি ক্রয় মূল্য:

# unknownLocation
source: Location not known
bn: অবস্থান জানা নেই

# saleTitle
source: Sale Transaction
bn: বিক্রয় লেনদেন

# saleScreenTitle
source: Sell
bn: বিক্রয় করুন

source: Fill All Fields
bn: সকল ঘর পূরণ করুন

# reportsTitle
source: Reports & Analytics
bn: রিপোর্ট ও বিশ্লেষণ

# noSeasonsFoundForReports
source: No seasons found to generate reports. Please add seasons first.
bn: রিপোর্ট তৈরি করার জন্য কোনো সিজন পাওয়া যায়নি। অনুগ্রহ করে প্রথমে সিজন যোগ করুন।

source: Season
bn: সিজন

source: Duration
bn: সময়কাল

source: Inventory Summary
bn: ইনভেন্টরি সারাংশ

# financialSummary
source: Summary
bn: সারাংশ

source: Sacks In Stock
bn: স্টকে থাকা বস্তা

source: Total Weight (In Stock)
bn: মোট ওজন (স্টকে)

source: Sacks Sold
bn: বিক্রি হওয়া বস্তা

source: Total Weight (Sold)
bn: মোট ওজন (বিক্রি)

source: Sacks Discarded
bn: বাদ দেওয়া বস্তা

# totalStockValue
source: Total Stock Value (In Stock)
bn: মোট স্টক মূল্য (স্টকে)

# notApplicable
source: N/A
bn: প্রযোজ্য নয়

source: Current Inventory Value:
bn: বর্তমান ইনভেন্টরি মূল্য:

# profitTrendBySeason
source: Profit/Loss Trend by Season
bn: সিজন অনুযায়ী লাভ/ক্ষতির প্রবণতা

source: Inventory Status Breakdown
bn: ইনভেন্টরি অবস্থার বিভাজন

# inStockShort
source: In Stock
bn: স্টকে আছে

# soldShort
source: Sold
bn: বিক্রি হয়েছে

# discardedShort
source: Discarded
bn: বাদ দেওয়া হয়েছে

source: Active Season
bn: সক্রিয় সিজন

source: Manage Seasons
bn: সিজন পরিচালনা করুন

# noProfitDataAvailable
source: No profit data available for charts.
bn: চার্টের জন্য কোনো লাভের ডেটা উপলব্ধ নেই।

# noInventoryDataForCharts
source: No inventory data available for charts.
bn: চার্টের জন্য কোনো ইনভেন্টরি ডেটা উপলব্ধ নেই।

source: Search Sacks
bn: বস্তা খুঁজুন

# searchSacksHint
source: Enter code, type, or notes...
bn: কোড, প্রকার বা নোট লিখুন...

source: All Products
bn: সব প্রকার

source: All Statuses
bn: সব অবস্থা

source: All Locations
bn: সব অবস্থান

source: Product Type
bn: পণ্যের প্রকার

source: Status
bn: অবস্থা

source: Location
bn: অবস্থান

source: Reset Filters
bn: ফিল্টার রিসেট করুন

source: Code
bn: কোড

source: Weight
bn: ওজন

source: Date
bn: তারিখ

source: Search Party
bn: পার্টি খুঁজুন

# searchPartyHint
source: Enter name or phone number...
bn: নাম বা ফোন নম্বর লিখুন...

source: All Types
bn: সব প্রকার

source: Party Type
bn: পার্টির প্রকার

# confirmDeleteParty
source: Are you sure you want to delete this party?
bn: আপনি কি নিশ্চিত এই পার্টিটি মুছে ফেলতে চান?

# partyTypeEmptyValidation
source: Please select a party type.
bn: অনুগ্রহ করে একটি পার্টির প্রকার নির্বাচন করুন।

# partyNameTypeEmptyValidation
source: Party name and type cannot be empty.
bn: পার্টির নাম এবং প্রকার খালি থাকতে পারে না।
